app/controllers/events_controller.rb

  def index
    @events = Event.where(issue_id: params[:issue_id])
---
SELECT `events`.* FROM `events` WHERE `events`.`issue_id` = 3